import React, { FC } from "react";
import { Dimensions } from "react-native";
import * as S from "./style";

const { height } = Dimensions.get("screen");

const PrivacyPolicy: FC = () => {
  return (
    <S.Container showsVerticalScrollIndicator={false} height={height - 200}>
      <S.Title>개인정보 처리방침</S.Title>
      <S.DescriptionContainer>
        <S.Description>
          본 사이트의 운영사 알리에팀(이하 ‘알리에팀’)은 알리에의 노잉(Knowing)
          서비스(이하 ‘노잉’)을 제공함에 있어 고객님의 개인정보를 중요시하며,
          ‘정보통신망 이용촉진 및 정보보호 등에 관한 법률’ 및 ‘개인정보보호법’등
          알리에팀이 준수하여야 할 개인정보 보호 법령을 준수하고 있습니다.
          알리에팀은 개인정보 처리방침을 통하여 고객님께서 제공하시는 개인정보가
          어떠한 용도와 방식으로 이용되고 있으며, 개인정보 보호를 위해 어떠한
          조ㄹ치가 취해지고 있는지 알려드립니다. 개인정보 처리방침을 개정하는
          경우 개별공지를 통하여 공지할 것입니다. 1. 개인정보의 수집목적 및
          보유기간 1) 개인정보 항목 및 이용목적 시점 수집 및 이용목적 수집 항목
          보유 및 이용 기간 회원 가입 시 회원제 서비스 제공 목적 이메일 가입시
          이메일, 패스워드 필수 목적 달성 후 즉시 파기, 서비스 이용시 부정
          이용행위 방지 및 비인가 사용 방지 IP Address, 쿠키, 방문 일시, 서비스
          이용 기록, 브라우저 종류 2) 보관 기간 관련법령 수집항목 보유기간
          전자상거래 등에서의 소비자 보호에 관한 법률 표시 및 광고에 관한 기록
          6개월 계약 및 청약철회 등에 관한 기록 5년 대금결제 및 재화등 공급에
          관한 기록 5년 소비자불만 및 분쟁처리에 관한 기록 3년 통신비밀 보호법
          로그기록 접속지 정보등 3개월 부정 이용행위 및 불법유포의 방지를 위해
          불량이용자의 이메일 정보를 1년간 보관 2.개인정보의 제3자 제공 1)
          개인정보 제공 업체 제공받는 자 제공목적 제공 항목 보유 및 이용 기간
          (주)엔에이치엔페이코 페이코 결제서비스 결제ID, 결제금액, 결제코인정보
          목적 달성 후 즉시 파기, (주)SK플래닛 오케이캐쉬백 결제ID, 결제금액,
          결제코인정보, 관련법령에서 별도의 보관기간을 정한 경우
          오케이캐쉬백카드번호 해당 시점까지 보관 (주)이제이엔 노벨피아 이벤트
          응모를 위한 노벨피아ID 제공 후 1년 본인확인, 부정참여 방지 및 보상
          지급 알리에팀은 이용자의 동의 없이 개인정보를 외부에 제공하지
          않습니다. 단, 이용자가 제휴사의 서비스를 이용하기 위해 동의한 경우
          관련법령에 따라서 개인정보를 제공합니다. 1. 개인정보 처리위탁
          알리에팀은 원활한 개인정보 업무처리를 위하여 개인정보를 위탁하고
          있으며, 위탁계약 체결시 개인정보가 안전하게 관리될 수 있도록
          관계법령에 따른 필요한 사항을 규정하고 있습니다. 알리에팀의 개인정보
          처리위탁 기관 및 위탁 업무 내용은 아래와 같습니다. 수탁자 위탁 업무
          알리에팀은 클라우드 서비스를 이용하는 과정에서 아마존 웹 서비스에 보관
          할 수 있습니다. 1. 개인정보의 파기 (1) 관련 법령 및 개인정보처리방침에
          따라 보유하는 정보를 제외한 모든 회원 및 계정 정보를 삭제하기 위하여
          일정기간 이후 탈퇴처리가 완료됩니다. (2) 알리에팀은 ‘개인정보
          유효기간제’에 따라 1년간 서비스를 이용하지 않은 회원의 개인정보를
          별도로 분리하여 보관하고 있습니다. (3) 회원탈퇴, 서비스 종료,
          이용자에게 동의 받은 개인정보 보유기간의 도래와 같이 개인정보의 수집
          및 이용목적이 달성된 개인정보는 재생이 불가능한 방법으로 파기하고
          있습니다. 법령에서 보존의무를 부과한 정보에 대해서도 해당 기간 경과 후
          지체 없이 재생이 불가능한 방법으로 파기합니다. 전자적 파일 형태의 경우
          복구 및 재생이 되지 않도록 기술적인 방법을 이용하여 안전하게 삭제하며,
          출력물 등은 분쇄하거나 소각하는 방식 등으로 파기합니다. 1. 이용자 및
          법정대리인의 권리와 행사방법 (1) 이용자(법정대리인을 포함함)는
          알리에팀에 대해 언제든지 다음 각 호의 개인정보와 관련하여
          열람ㆍ정정ㆍ삭제 또는 처리정지 요구 등의 권리를 행사할 수 있습니다. •
          알리에팀이 보유하고 있는 이용자의 개인정보 • 알리에팀이 이용자의
          개인정보를 이용하거나 제 3자에게 제공한 현황 • 알리에팀에게 개인정보
          수집ㆍ이용ㆍ제공 등의 동의를 한 현황 (2) 제1항에 따른 권리 행사는
          이용자의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수
          있습니다. 이 경우 개인정보보호법 시행규칙 별지 제11호 서식에 따른
          위임장을 제출하셔야 합니다. (3) 제1항에 따른 권리 행사 시 알리에팀은
          권리 행사를 한 자가 이용자 본인이거나 정당한 대리인인지를 확인합니다.
          (4) 이용자가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한
          경우에는 알리에팀은 정정 또는 삭제를 완료할 때까지 당해 개인정보를
          이용하거나 제공하지 않습니다. (5) 이용자의 개인정보 열람 및 처리정지
          요구는 개인정보 보호법 제 35조 제4항, 제 37조 제2항에 의하여 이용자의
          권리가 제한될 수 있습니다. (6) 이용자의 개인정보 정정 또는 삭제 요구는
          개인정보 보호법 제 36조 제1항에 의하여 다른 법령에서 그 개인정보가
          수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다. (7)
          이용자는 개인정보보호법 등 관계법령을 위반하여 알리에팀이 처리하고
          있는 이용자 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니
          됩니다. (8) 당사는 법정 대리인의 동의가 필요한 만 14세 미만 아동의
          회원가입을 받지 않습니다. 1. 개인정보보호를 위한 노력(기술적ᆞ관리적
          보호대책) (1) 알리에팀은 이용자의 개인정보를 안전하게 관리하기 위하여
          최선을 다하며, 정보통신망법 및 개인정보보호법에서 요구하는 수준으로
          개인정보를 보호하고 있습니다. (2) 개인정보를 암호화하고 있습니다.
          비밀번호는 일방향 암호화 하고 있으며, 카드번호 등을 수집하는 경우
          암호화하여 저장하고 있습니다. (3) 대내외의 보안 위험으로부터
          개인정보를 안전하게 관리합니다. 해킹이나 컴퓨터 바이러스 등에 의해
          회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 외부로부터 접근이
          통제된 구역에 시스템을 설치하고 있습니다. 개인정보의 훼손에 대비해서
          자료를 수시로 백업하고 있고, 최신 백신프로그램을 이용하여 이용자들의
          개인정보나 자료가 유출되거나 손상되지 않도록 방지하고 있습니다. 암호화
          통신 등을 통하여 네트워크상에서 개인정보를 안전하게 송수신하고
          있습니다. (4) 개인정보취급자를 최소한으로 유지하고 있습니다.
          개인정보에 접근할 수 있는 인원을 최소화하고 있으며, 개인정보처리자에
          대한 정기 교육, 전사 임직원에 대한 수시 교육 및 캠페인을 통하여 법령
          및 내부방침 등의 준수를 강조하고 있습니다. (5) 개인정보보호 전담
          조직을 운영하고 있습니다. 알리에팀은 개인정보의 보호를 위해
          개인정보보호 전담부서를 운영하고 있으며, 개인정보처리방침의 이행사항
          및 담당자의 준수여부를 확인하여 문제가 발견될 경우 즉시 해결하고 바로
          잡을 수 있도록 최선을 다하고 있습니다. 1. 인터넷 접속정보파일 등
          개인정보 자동수집 장치의 설치·운영 및 그 거부 (1) 알리에팀은 고객에게
          특화된 맞춤서비스를 제공하기 위해서 고객의 정보를 저장하고 수시로
          불러오는 ＇쿠키(cookie)＇를 사용합니다. 쿠키는 웹사이트를 운영하는데
          이용되는 서버(HTTP)가 이용자의 컴퓨터 브라우저에게 보내는 소량의
          정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다. (2)
          고객은 쿠키 설치에 대한 선택권을 가지고 있습니다. 따라서, 고객은
          웹브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나, 쿠키가
          저장될 때마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수도
          있습니다. 설정방법 예(인터넷 익스플로어의 경우) : 웹 브라우저 상단의
          도구 {">"} 인터넷 옵션 {">"} 개인정보 다만, 쿠키의 저장을 거부할
          경우에는 로그인이 필요한 서비스는 이용할 수 없습니다. 1. 개인정보
          보호책임자 및 담당자 안내 (1) 알리에팀은 이용자의 개인정보 관련
          문의사항을 위하여 아래와 같이 개인정보 보호책임자 및 보호담당자를
          지정하고 있습니다. 구분 개인정보 보호책임자 개인정보 보호담당자 이름
          직위 전화 010-8649-1256 메일 allie220101@gmail.com 노잉(Knowing)을
          이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제
          등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수
          있습니다. 알리에팀은 정보주체의 문의에 대해 지체 없이 답변 및
          처리해드릴 것입니다. (2) 기타 개인정보 침해에 대한 신고나 상담이
          필요하신 경우 아래 기관에 문의하실 수 있습니다. • 개인정보침해신고센터
          (privacy.kisa.or.kr / 국번없이 118) • 대검찰청 사이버수사과
          (www.spo.go.kr / 국번없이 1301) • 경찰청 사이버안전국
          (cyberbureau.police.go.kr / 국번없이 182) 1. 개정 전 고지 의무 본
          개인정보처리방침의 내용 추가, 삭제 및 수정이 있을 경우 개정 최소 7일
          전에 사전 공지를 할 것입니다. 다만, 수집하는 개인정보의 항목,
          이용목적의 변경 등과 같이 이용자 권리의 중대한 변경이 발생할 때에는
          최소 30일 전에 공지하며, 필요 시 이용자 동의를 다시 받을 수도
          있습니다. - 공고일자: 2022년 04월 05일 - 시행일자: 2022년 04월 15일
        </S.Description>
      </S.DescriptionContainer>
    </S.Container>
  );
};

export default PrivacyPolicy;
