export type BANK =
  | "NH농협"
  | "KB국민"
  | "카카오뱅크"
  | "신한"
  | "우리"
  | "IBK기업"
  | "하나"
  | "새마을"
  | "대구"
  | "부산"
  | "케이뱅크"
  | "우체국"
  | "신협"
  | "SC제일"
  | "경남"
  | "수협"
  | "광주"
  | "전북"
  | "토스뱅크"
  | "저축은행"
  | "중국공상"
  | "JP모간"
  | "BNP파리바"
  | "씨티"
  | "제주"
  | "KDB산업"
  | "SBI저축은행"
  | "산림조합"
  | "BOA"
  | "HSBC"
  | "중국"
  | "도이치"
  | "중국건설";

export const BANK_ARRAY = [
  "NH농협",
  "KB국민",
  "카카오뱅크",
  "신한",
  "우리",
  "IBK기업",
  "하나",
  "새마을",
  "대구",
  "부산",
  "케이뱅크",
  "우체국",
  "신협",
  "SC제일",
  "경남",
  "수협",
  "광주",
  "전북",
  "토스뱅크",
  "저축은행",
  "중국공상",
  "JP모간",
  "BNP파리바",
  "씨티",
  "제주",
  "KDB산업",
  "SBI저축은행",
  "산림조합",
  "BOA",
  "HSBC",
  "중국",
  "도이치",
  "중국건설",
];
